УТ_для_edt/src/InformationRegisters/CRM_НастройкиПользователей/CRM_НастройкиПользователей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>CRM_НастройкиПользователей</name>
  <resources>
    <name>Значение</name>
    <type>
      <types>Characteristic.CRM_НастройкиПользователей</types>
    </type>
  </resources>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Настройка</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.CRM_НастройкиПользователей</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt/src/Catalogs/ГруппыПользователей/ГруппыПользователей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ГруппыПользователей</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <predefined>
    <items>
      <name>ВсеПользователи</name>
      <description>Все пользователи</description>
    </items>
  </predefined>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Состав</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>смартБизнесРегионы</name>
    <comment>//++ #1543 смарт: Фролов 22.11.2023 //Автоматическое распределение лидов на менеджеров</comment>
    <attributes>
      <name>БизнесРегион</name>
      <type>
        <types>CatalogRef.БизнесРегионы</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ_для_edt/src/Catalogs/Пользователи/Пользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Пользователи</name>
  <comment>АПК:413 - №744.2.1.1 Допустимо не отключать историю выбора, так как она используется, а переопределение отбора фиксированное, то есть служебные и недействительные пользователи в нее не попадут, но если как-то попали, то это не является проблемой</comment>
  <attributes>
    <name>Недействителен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>DefinedType.Подразделение</types>
    </type>
  </attributes>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>DefinedType.ФизическоеЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Служебный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подготовлен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяИБ</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяСервиса</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>СвойстваПользователяИБ</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ДолжностнаяПозиция</name>
    <type>
      <types>CatalogRef.CRM_ДолжностныеПозиции</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ОтписалсяОтEmailРассылок</name>
    <comment>Отписался от Email рассылок</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_Планируемый</name>
    <comment>Участвует в планировании проектов</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_УчаствуетВАнкетировании</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_Фотография</name>
    <comment>Фотография клиента частное лицо</comment>
    <type>
      <types>CatalogRef.ПользователиПрисоединенныеФайлы</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_НаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ЕмейлДляСинхронизации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Фотография</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_РазрешеноИзменятьКоординаты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>смартМенеджерСайта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>смартРабочаяПочта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>смартРабочийТелефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>смартВнутреннийНомерВАТС</name>
    <comment>#1352 смарт: Лопато 04.05.2023 //Звонки из 1С (через городской стационарный телефон)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>смартДоступныДанныеВнутреннихФизическихЛиц</name>
    <comment>#1644 смарт: Ермаков 19.04.2024 / Изменить доступ к документам физических лиц</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>смартДоступныДанныеВнешнихФизическихЛиц</name>
    <comment>#1644 смарт: Ермаков 19.04.2024 / Изменить доступ к документам физических лиц</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>смартВнутреннийНомерВАТСДополнительный</name>
    <comment>//++ #Б-6744 смарт: Фролов 28.05.2026 //Перехват заявок. Загрузка звонков в 1С с нескольких мобильных менеджеров</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>сфпВремяЗадержкиНабораДобавочногоНомера</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>CRM_ДополнительнаяИнформация</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.CRM_ДополнительнаяИнформация</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.CRM_ДополнительнаяИнформация</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаРегистрации</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>смартОповещениеОбИнтересах</name>
    <comment>//++ #Б-3560 смарт: Фролов 01.07.2025 //Создания механизма настройки оповещений о событиях с Интересами. </comment>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.СтруктураПредприятия</types>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Новые</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Квалификация</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Завершенные</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Оборудование</name>
      <comment>//++ #Б-3858 смарт: Фролов 18.07.2025 //Расширение настройки отправки оповещений о обработке Интересов.</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Запчасти</name>
      <comment>//++ #Б-3858 смарт: Фролов 18.07.2025 //Расширение настройки отправки оповещений о обработке Интересов.</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>РасходныеМатериалы</name>
      <comment>//++ #Б-3858 смарт: Фролов 18.07.2025 //Расширение настройки отправки оповещений о обработке Интересов.</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Прочее</name>
      <comment>//++ #Б-3858 смарт: Фролов 18.07.2025 //Расширение настройки отправки оповещений о обработке Интересов.</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбъектОповещения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>смартКонтролируемыеМенеджеры</name>
    <comment>//++ #Б-7838 смарт: Фролов 12.08.2026 //Уведомления для Беловой Т.</comment>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ_для_edt/src/CommonModules/смартПользователи/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Модуль "смартПользователи" содержит процедуры и функции для 
// работы с пользователями, ролями и доступом.
// 
// Модуль создал - Ермаков, 12.04.2024
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

#Область НастройкиПользователей

// Определяет, включена ли настройка "Использовать подсистему 1С:CRM" у пользователя 
//
// Параметры:
// 		Пользователь - СправочникСсылка.Пользователи
// Возвращаемое значение:
// 		Булево - Истина, если опция включена
//
Функция ИспользуетПодсистемуCRM(Пользователь = Неопределено) Экспорт
	
	//++ #1760 смарт: Ермаков 12.04.2024 / Создание механизма оповещений менеджеров о назначенных Интересах.
	Если Пользователь = Неопределено Тогда
		Пользователь = Пользователи.АвторизованныйПользователь();
	КонецЕсли;

	МенеджерЗаписи = РегистрыСведений.CRM_НастройкиПользователей.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Пользователь = Пользователь;
	МенеджерЗаписи.Настройка = ПланыВидовХарактеристик.CRM_НастройкиПользователей.ИспользоватьCRM;
	МенеджерЗаписи.Прочитать();
	
 	Возврат ?(МенеджерЗаписи.Выбран(), МенеджерЗаписи.Значение, Ложь);
	//-- #1760 смарт: Ермаков 12.04.2024
	
КонецФункции

// Определяет, включена ли пользователь в состав группы "Секретариат"
//
// Параметры:
// 		Пользователь - СправочникСсылка.Пользователи
// Возвращаемое значение:
// 		Булево - Истина, если пользователь включен в группу
//
Функция ЭтоСекретарь(Пользователь = Неопределено) Экспорт
	
	//++ #1760 смарт: Ермаков 12.04.2024 / Создание механизма оповещений менеджеров о назначенных Интересах.
	Если Пользователь = Неопределено Тогда
		Пользователь = Пользователи.АвторизованныйПользователь();
	КонецЕсли;
	
	Группа = Справочники.ГруппыПользователей.НайтиПоНаименованию("Секретариат", Истина);
	
	Если Группа.Пустая() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Не Группа.Состав.Найти(Пользователь, "Пользователь") = Неопределено;
	//-- #1760 смарт: Ермаков 12.04.2024
	
КонецФункции

// Определяет есть ли у пользователя роль
//
// Параметры:
// 		ИмяРоли - Строка
//++ #1934 смарт: Фролов 18.07.2024 //Организовать доступ РОПов к Интересам своих менеджеров
Функция РольДоступнаПользователю(ИмяРоли) Экспорт

	Возврат РольДоступна(ИмяРоли);	
	
КонецФункции //-- #1934 смарт: Фролов 18.07.2024

//++ #1929 смарт: Фролов 05.09.2024 //Создание рабочего места сотрудника с Задачами/Взаимодействиями/Поручениями
Функция ОткрыватьРабочийСтолСотрудника(Пользователь = Неопределено) Экспорт
	
	Если Пользователь = Неопределено Тогда
		Пользователь = Пользователи.АвторизованныйПользователь();
	КонецЕсли;
	
	МенеджерЗаписи = РегистрыСведений.CRM_НастройкиПользователей.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Пользователь = Пользователь;
	МенеджерЗаписи.Настройка = ПланыВидовХарактеристик.CRM_НастройкиПользователей.смартИспользоватьРабочийСтолСотрудника;
	МенеджерЗаписи.Прочитать();
	
 	Возврат ?(МенеджерЗаписи.Выбран(), МенеджерЗаписи.Значение, Ложь);

КонецФункции //-- #1929 смарт: Фролов 05.09.2024	

//++ #Б-1954 смарт: Лопато 22.01.2025 //Заказ клиента. Колонка "Кто консультировал". Настроить выбор.  
Функция ПолучитьМассивПользователейКтоКонсультировал() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫРАЗИТЬ(Объект КАК Справочник.Пользователи) КАК Пользователь
		|ИЗ
		|	РегистрСведений.ДополнительныеСведения
		|ГДЕ
		|	Свойство = &Свойство
		|	И Значение = ИСТИНА
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВЫБОР 
		|		КОГДА ВЫРАЗИТЬ(Объект КАК Справочник.Пользователи).Наименование = ""Никто"" 
		|		ТОГДА 0 
		|		ИНАЧЕ 1 
		|	КОНЕЦ,
		|	Пользователь
		|АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("Свойство", 
		ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту(
			"ИдентификаторДляФормул", "УчаствуетВВыбореКтоКонсультировалВЗаказеКлиента"));
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Пользователь");
	
КонецФункции //-- #Б-1954 смарт: Лопато 22.01.2025

#КонецОбласти

#КонецОбласти
